DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  webServer.send(200, "text/html; charset=utf-8", "<!doctype html><p>WiFi settings cleared. Vibe TV is restarting setup.</p>");
  drawWifiResetStatus("Restarting");
  waitStatusRendered = true;
  delay(500);
  clearWifiCredentials();
  clearSdkWifiCredentials();
  delay(250);
  persistResetTrustForRestart();
  ESP.restart();
}

void addCorsHeaders() {
  webServer.keepAlive(false);
  webServer.sendHeader("Access-Control-Allow-Origin", "*");
  webServer.sendHeader("Access-Control-Allow-Methods", "GET,POST,DELETE,OPTIONS");
  webServer.sendHeader("Access-Control-Allow-Headers", String("Content-Type,") + kDeviceAuthHeader);
}

void handleHello() {
  addCorsHeaders();
  if (requestAuthToken().length() > 0 && !requireWriteAuth()) {
    return;
  }

  const String out = codexbar_display::app::BuildDeviceHelloJSON(
      makeTransportConfig("wifi"));
  webServer.send(200, "application/json", out);
}

bool parseConnectionModeRequest(
    device_settings::ConnectionMode& mode,
    String& expectedDeviceID,
    String& error) {
  JsonDocument doc;
  if (deserializeJson(doc, webServer.arg("plain"))) {
    error = "invalid JSON body";
    return false;
  }
  expectedDeviceID = String(doc["deviceId"] | "");
  mode = requestedConnectionMode(String(doc["mode"] | ""));
  if (expectedDeviceID != deviceID) {
    error = "deviceId does not match";
    return false;
  }
  if (mode == device_settings::ConnectionMode::kUnspecified) {
    error = "mode must be cable or wifi";
    return false;
  }
  return true;
}

void handleConnectionModeSwitch() {
  addCorsHeaders();
  if (!requireWriteAuth()) {
    return;
  }
  device_settings::ConnectionMode target =
      device_settings::ConnectionMode::kUnspecified;
  String expectedDeviceID;
  String error;
  if (!parseConnectionModeRequest(target, expectedDeviceID, error) ||
      !beginConnectionTransition(target, error)) {
    webServer.send(400, "text/plain; charset=utf-8", error);
    return;
  }
  String out;
  out.reserve(180);
  out += "{\"ok\":true,\"deviceId\":\"";
  out += deviceID;
  out += "\",\"mode\":\"";
  out += device_settings::ConnectionModeName(target);
  out += "\",\"confirmationRequired\":true}";
  webServer.send(202, "application/json", out);
  scheduleReboot("connection_mode_switch");
}

void handleConnectionModeConfirmation() {
  addCorsHeaders();
  if (!requireWriteAuth()) {
    return;
  }
  JsonDocument doc;
  if (deserializeJson(doc, webServer.arg("plain"))) {
    webServer.send(400, "text/plain; charset=utf-8", "invalid JSON body");
    return;
  }
  String status;
  if (!confirmConnectionTransition(String(doc["deviceId"] | ""), status)) {
    webServer.send(409, "text/plain; charset=utf-8", status);
    return;
  }
  String out = "{\"ok\":true,\"deviceId\":\"";
  out += deviceID;
  out += "\",\"mode\":\"";
  out += device_settings::ConnectionModeName(deviceSettings.connectionMode);
  out += "\",\"status\":\"";
  out += status;
  out += "\"}";
  webServer.send(200, "application/json", out);
}

void emitSerialStatus() {
  String out;
  out.reserve(240);
  out += "{\"kind\":\"status\",\"deviceId\":\"";
  out += deviceID;
  out += "\",\"board\":\"";
  out += CODEXBAR_DISPLAY_BOARD_ID;
  out += "\",\"firmware\":\"";
  out += CODEXBAR_DISPLAY_FW_VERSION;
  out += "\",\"connectionMode\":\"";
  out += codexbar_display::esp8266::device_settings::ConnectionModeName(
      deviceSettings.connectionMode);
  out += "\",\"transitionPending\":";
  out += connectionTransitionPending ? "true" : "false";
  out += ",\"transport\":\"usb\",\"hasFrame\":";
  out += codexbar_display::app::HasFrame(runtimeCtx) ? "true" : "false";
  out += "}";
  Serial.println(out);
}

bool handleSerialControlLine(const String& line) {
  JsonDocument doc;
  if (deserializeJson(doc, line)) {
    return false;
  }
  const String kind = String(doc["kind"] | "");
  if (kind != "request") {
    return false;
  }

  const String op = String(doc["op"] | "");
  if (op == "hello") {
    codexbar_display::app::EmitDeviceHello(makeTransportConfig("usb"));
  } else if (op == "status") {
    emitSerialStatus();
  } else if (op == "set-connection-mode") {
    const String expectedDeviceID = String(doc["deviceId"] | "");
    const device_settings::ConnectionMode target =
        requestedConnectionMode(String(doc["mode"] | ""));
    String error;
    if (expectedDeviceID != deviceID) {
      error = "deviceId does not match";
    } else if (!beginConnectionTransition(target, error)) {
      // beginConnectionTransition supplies the customer-safe reason.
    }
    if (error.length() > 0) {
      String out = "{\"kind\":\"error\",\"code\":\"connection-mode-rejected\",\"message\":\"";
      out += jsonEscape(error);
      out += "\"}";
      Serial.println(out);
    } else {
      String out = "{\"kind\":\"connection-mode\",\"status\":\"switching\",\"deviceId\":\"";
      out += deviceID;
      out += "\",\"mode\":\"";
      out += device_settings::ConnectionModeName(target);
      out += "\",\"confirmationRequired\":true}";
      Serial.println(out);
      scheduleReboot("connection_mode_switch");
    }
  } else if (op == "confirm-connection-mode") {
    String status;
    if (!confirmConnectionTransition(String(doc["deviceId"] | ""), status)) {
      String out = "{\"kind\":\"error\",\"code\":\"connection-mode-confirmation-rejected\",\"message\":\"";
      out += jsonEscape(status);
      out += "\"}";
      Serial.println(out);
    } else {
      String out = "{\"kind\":\"connection-mode\",\"status\":\"";
      out += status;
      out += "\",\"deviceId\":\"";
      out += deviceID;
      out += "\",\"mode\":\"";
      out += device_settings::ConnectionModeName(deviceSettings.connectionMode);
      out += "\"}";
      Serial.println(out);
    }
  } else {
    String out;
    out.reserve(100);
    out += "{\"kind\":\"error\",\"code\":\"unsupported-request\",\"op\":\"";
    out += jsonEscape(op);
    out += "\"}";
    Serial.println(out);
  }
  return true;
}

void handleSerialInput() {
  String line;
  if (!codexbar_display::app::ReadSerialLine(runtimeCtx, line)) {
    return;
  }
  if (!codexbar_display::esp8266::device_settings::SupportsCable(
          deviceSettings.connectionMode) ||
      deviceSettings.connectionMode !=
          codexbar_display::esp8266::device_settings::ConnectionMode::kCable) {
    return;
  }
  if (handleSerialControlLine(line)) {
    return;
  }

  codexbar_display::core::SerialConsumeEvent event;
  if (codexbar_display::core::ConsumeFrameLine(
          runtimeCtx.runtime, line.c_str(), millis(), event) &&
      event.frameAccepted) {
    markFrameAccepted(event, "usb");
  }
}

bool isSafeAssetPath(const String& path) {
  return codexbar_display::esp8266::AssetPathPolicy::IsSafeSyntax(path.c_str(), path.length());
}

bool isMutableThemeAssetPath(const String& path) {
  return codexbar_display::esp8266::AssetPathPolicy::IsMutableThemeAsset(path.c_str(), path.length());
}

bool isLiveThemeSpecPath(const String& path) {
  return codexbar_display::esp8266::AssetPathPolicy::IsLiveThemeSpecPath(path.c_str(), path.length());
}

